#+TITLE: smRen's Literate Emacs config
#+AUTHOR: smRen
#+EMAIL: smakey18@gmail.com
#+STARTUP: content

* UI
  #+begin_src emacs-lisp
    ;; Scroll
    (setq scroll-conservatively 101)

    ;; Show matching parenthesis
    (show-paren-mode 1)

    ;; Disable toolbar, menubar, and scrollbar
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    ;; Display line numbers
    (add-hook 'prog-mode-hook 'display-line-numbers-mode)

    (use-package counsel
      :ensure t
      :after ivy
      :config (counsel-mode))

    (use-package ivy
      :ensure t
      :config
      (global-set-key (kbd "C-x C-r") 'counsel-recentf)
      (global-set-key (kbd "C-x C-d") 'counsel-dired)
      (global-set-key (kbd "C-c t") 'counsel-load-theme)
      (ivy-mode))

    (use-package ivy-rich
      :ensure t
      :config
      (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
      (ivy-rich-mode))

    ;; Emoji char
    ;; Depends on os type
    (cond ((string-equal system-type "darwin")
	   (set-fontset-font t 'symbol "Apple Color Emoji")
	   (message "Mac OS X"))
	  ((string-equal system-type "gnu/linux")
	   (set-fontset-font t 'symbol "Noto Color Emoji")
	   (message "Linux"))
	  ((string-equal system-type "windows-nt")
	   (set-fontset-font t 'symbol "Segoe UI Emoji")
	   (message "Windows")))

    ;; Font and font size
    ;; Depends on monitor resolution
    (cond ((equal '(0 0 1920 1080) (frame-monitor-geometry))
	   (set-frame-font "Hack-10" nil t)
	   (message "1080p monitor detected"))
	  ((equal '(0 0 2736 1824) (frame-monitor-geometry))
	   (set-frame-font "Hack-11" nil t)
	   (message "Super High res monitor detected (Probably Surface Pro)")))
  #+end_src

  #+RESULTS:
  : 1080p monitor detected

* Custom functions
  Remote c++ lsp
  #+begin_src emacs-lisp
    (lsp-register-client
	(make-lsp-client :new-connection (lsp-tramp-connection "clangd")
			 :major-modes '(c++-mode)
			 :remote? t
			 :server-id 'c++-remote))
  #+end_src

  #+RESULTS:
  : (standard-value (nil) custom-type hook custom-package-version (lsp-mode . 7.0.1) variable-documentation Hooks to run after `c++-remote' server is run. custom-requests nil)
  
  Customize c++
  #+begin_src emacs-lisp
    (setq-default c-basic-offset 4)
  #+end_src

  #+RESULTS:
  : 4
  
  #+BEGIN_SRC emacs-lisp
    ;; Function for shutdown emacs server instance
    (defun server-shutdown ()
      "Save buffers, Quit, and Shutdown (kill) server"
      (interactive)
      (save-some-buffers)
      (Kill-emacs))
  #+END_SRC

  #+RESULTS:
  : server-shutdown
  
